results/ryzen9-7950x-node0/e2e-v2/runs/f-h1-arena-direct/h2load.txt
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #1: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #2: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #3: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
Warm-up started for thread #2.
Warm-up started for thread #3.
Warm-up started for thread #Warm-up started for thread #0.
1.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
progress: 43% of clients started
progress: 50% of clients started
progress: 56% of clients started
progress: 62% of clients started
progress: 68% of clients started
progress: 75% of clients started
progress: 81% of clients started
progress: 87% of clients started
progress: 93% of clients started
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
progress: 100% of clients started
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Application protocol: http/1.1
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 20.00s, 300662.40 req/s, 1.27GB/s
requests: 6013248 total, 6013312 started, 6013248 done, 6013248 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 6013248 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 25.34GB (27203934656) total, 670.96MB (703553994) headers (space savings 0.00%), 24.46GB (26266016480) data
                     min         max         mean         sd        +/- sd
time for request:       27us     50.35ms       216us       241us    99.21%
time for connect:        1us       110us        55us        31us    59.38%
time to 1st byte:    34.91ms     50.36ms     41.22ms      4.61ms    62.50%
req/s           :    4661.21     4751.67     4697.81       24.69    67.19%